package hw11.Menu;

import hw11.Controller.FamilyController;

public class Menu {
    public static final FamilyController familyController = new FamilyController();

    public static void showMenu() {
        System.out.println();
        System.out.println("-----------------------Меню------------------------");
        System.out.println(
        "1. Завантажити список сімей з бази даних\n" +
        "2. Відобразити весь список сімей\n" +
        "3. Відобразити список сімей, де кількість людей більша за задану\n" +
//                - запитати цікаве число
        "4. Відобразити список сімей, де кількість людей менша за задану\n" +
//                - запитати цікаве число
        "5. Підрахувати кількість сімей, де кількість членів дорівнює\n" +
//                - запитати цікаве число
        "6. Створити нову родину\n" +
//              - запитати ім'я матері
//              - запитати прізвище матері
//                - Запитати рік народження матері
//                - Запитати місяць народження матері
//                - Запросити день народження матері
//                - запитати iq матері

//                - запитати ім'я батька
//                - Запитати прізвище батька
//                - Запитати рік народження батька
//                - Запитати місяць народження батька
//                - Запросити день народження батька
//                - запитати батька iq
        "7. Видалити сім'ю за індексом сім'ї у загальному списку\n" +
//        - Запитати порядковий номер сім'ї (ID)
        "8. Редагувати сім'ю за індексом сім'ї у загальному списку\n" +
//        - 1. Народити дитину
//            - Запитати порядковий номер сім'ї (ID)
//            - Запитати необхідні дані (яке ім'я дати хлопчику, яке дівчинці)
//        - 2. Усиновити дитину
//            - Запитати порядковий номер сім'ї (ID)
//            - запитати необхідні дані (ПІБ, рік народження, інтелект)
//        - 3. Повернутися до головного меню
        "9. Видалити всіх дітей старше віку (у всіх сім'ях видаляються діти старше зазначеного віку - вважатимемо, що вони виросли)\n" +
        "Exit - вихід з програми\n" +
                "____________________________________________________________");
//                - Запитати цікавий вік');
    }

    public static void menuEditFamily(){
            System.out.println();
            System.out.println("_____Меню редагування родини____\n" +
                               "1. Народити дитину\n" +
                               "2. Усиновити дитину\n" +
                               "3. Повернутися до головного меню\n" +
                               "________________________________");
    }

    public static void menuEditFamilyAdopt() {
        System.out.println();
        System.out.println( "_________Меню всиновлення дитини_________\n" +
                            "1. Всиновлено хлопчик\n" +
                            "2. Всиновлено дівчинку\n" +
                            "3. Повернутися до меню редагування родини\n" +
                            "_________________________________________");
    }
}

